---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCOpeningData.GetExtrusionData
source: html/0fa821c5-37df-2e15-833f-09174983d2f0.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData.GetExtrusionData Method

Gets extrusion data.

## Syntax (C#)
```csharp
public IList<IFCExtrusionData> GetExtrusionData()
```

## Returns
The extrusion data.